{
  "Bubble Sort": {
    "deskripsi": "Algoritma bubble sort merupakan salah satu teknik pengurutan sederhana, yang dilakukan dengan menelusuri sebuah list, membandingkan elemen yang berdekatan, kemudian menukarnya apabila posisinya tidak tepat.\n\nUntuk mengurutkan seluruh elemen pada list, proses penelusuran ini dilakukan secara berulang-ulang sebanyak n-1 kali (n jumlah elemen pada list), dimana tiap siklus penelusuran bertujuan menempatkan satu angka pada posisi yang tepat.\n\nIstilah bubble sort sendiri digunakan karena secara visual, seolah-olah setiap elemen terlihat bergerak ke atas/kanan (indeks yang lebih besar) seperti gelembung udara yang naik ke permukaan air.",
    "gambar": "https://en.wikipedia.org/wiki/File:Bubble-sort-example-300px.gif",
    "baca_lebih_lanjut": "https://koding.alza.web.id/algoritma-bubble-sort/"
  },
  "Selection Sort": {
    "deskripsi": "Algoritma selection sort, sesuai dengan namanya (select = pilih), merupakan teknik pengurutan yang dilakukan dengan memilih nilai terbesar/terkecil dari sekumpulan nilai kemudian meletakkannya pada posisi ujung kumpulan nilai tersebut.",
    "gambar": "https://upload.wikimedia.org/wikipedia/commons/9/94/Selection-Sort-Animation.gif",
    "baca_lebih_lanjut": "https://koding.alza.web.id/algoritma-selection-sort/"
  },
  "Insertion Sort": {
    "deskripsi": "Insertion pada algoritma insertion sort, dapat diterjemahkan menjadi penyisipan. Pada algoritma ini, setiap elemen list disisipkan ke posisi yang sesuai pada sisi list yang terurut.\n\nPada insertion sort, list dibagi menjadi dua bagian, bagian yang belum terurut dan yang sudah terurut. Algoritma ini melakukan iterasi pada setiap elemen, mencarikan posisi yang tepat untuk elemen tersebut pada bagian yang seudah terurut, kemudian menyisipkannya pada posisi tersebut.",
    "gambar": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Insertion-sort-example.gif",
    "baca_lebih_lanjut": "https://koding.alza.web.id/algoritma-insertion-sort/"
  },
  "Quick Sort": {
    "deskripsi": "Algoritma quick sort adalah algoritma pengurutan yang menggunakan proses pemisahan (partitioning) berdasarkan suatu nilai pembatas (pivot) secara berulang-ulang hingga suatu untaian nilai menjadi terurut.",
    "gambar": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Sorting_quicksort_anim.gif",
    "baca_lebih_lanjut": "https://koding.alza.web.id/algoritma-quick-sort/"
  },
  "Merge Sort": {
    "deskripsi": "Secara literal merge sort berarti mengurutkan dengan cara menggabungkan. Sesuai dengan namanya, algoritma pengurutan merge sort melibatkan penggabungan secara berulang-ulang hingga membentuk rangkaian nilai yang terurut.\n\nBerdasarkan jenisnya, algoritma ini termasuk dalam kategori algoritma divide and conquer, yang bekerja secara rekursif (lihat artikel) memecah kemudian menggabungkan rangkaian nilai yang ingin diurutkan sampai seluruh nilai menjadi terurut.",
    "gambar": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Merge-sort-example-300px.gif",
    "baca_lebih_lanjut": "https://koding.alza.web.id/algoritma-merge-sort/"
  }
}